/* 
Задание 4
Необязательное задание. (Если вам показалось домашнее задание простым, выполняем данный пункт)
(Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)

Необходимо от пользователя получить число.
Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.

Пример:
Пользователь ввел число 163. Программа должна вывести:
"В числе 163 количество сотен: 1, десятков: 6, единиц: 3"

Пример 2:
Пользователь ввел число 74. Программа должна вывести:
"В числе 74 количество сотен: 0, десятков: 7, единиц: 4"

Пример 3:
Пользователь ввел число 9537. Программа должна вывести:
"В числе 9537 количество сотен: 5, десятков: 3, единиц: 7"

Уточнение: пользователь всегда вводит корректное положительное целое число.
*/


let num = 6195;
let temp = num;

let a;
let b;
let c;

if (10 > num > 0) {
    a = num % 10;
    console.log(`В числе ${num} количество сотен: 0, десятков: 0, единиц: ${a}`);
} else if (100 > num > 10) {
    a = temp % 10;
    temp = parseInt(temp / 10);
    b = temp % 10;
    console.log(`В числе ${num} количество сотен: 0, десятков: ${b}, единиц: ${a}`);
} else {
    a = temp % 10;
    temp = parseInt(temp / 10);
    b = temp % 10;
    temp = parseInt(temp / 10);
    c = temp % 10;
    console.log(`В числе ${num} количество сотен: ${c}, десятков: ${b}, единиц: ${a}`);
}
